[
  {
    "id": "entry-2025-06-14-a",
    "title": "SpaceX Launch Tracker App",
    "date": "2025-06-14",
    "tags": ["blog", "project", "React-native"],
    "content": [
      {
        "type": "image",
        "src": "../assets/img/spacexapp/spaceXApi.jpg",
        "alt": "Example Image"
      },
      {
        "type": "text",
        "value": "This project documents the development of a mobile application built with React Native, designed to interact with the official SpaceX API. The app retrieves and displays structured data about rocket launches, providing users with access to detailed mission information, launch timelines, vehicles, and payloads. The technical process includes API integration techniques, asynchronous data fetching, state management, and UI composition optimized for mobile devices. Each entry reflects the architectural choices, implementation challenges, and iterative improvements carried out across the app’s lifecycle."
      }
    ]
  },
  {
    "id": "entry-2025-06-15-a",
    "title": "Project Setup: SpaceX Launch Tracker App",
    "date": "2025-06-15",
    "tags": ["blog", "project"],
    "content": [
      {
        "type": "text",
        "value": "This is the first post in the development log for the SpaceX Launch Tracker App, a mobile application built with React Native that fetches launch data from the public SpaceX API."
      },
      {
        "type": "text",
        "value": "The goal of the app is to provide users with a simple and accessible way to view information about upcoming and past launches — including mission details, launch dates, rockets, and payloads — all within a clean mobile interface."
      },
      {
        "type": "text",
        "value": "In this initial stage, I focused on getting the project up and running:"
      },
      {
        "type": "text",
        "value": "— Setting up the React Native environment"
      },
      {
        "type": "text",
        "value": "— Installing base dependencies"
      },
      {
        "type": "text",
        "value": "— Organizing the folder structure"
      },
      {
        "type": "text",
        "value": "— Defining core tools"
      },
      {
        "type": "text",
        "value": "This post sets the foundation. Future updates will cover API integration, data handling, UI components, and the decisions made along the way as the app takes shape."
      },
      {
        "type": "text",
        "value": "The idea is to document the full process, including challenges, as transparently as possible."
      },
      {
        "type": "code",
        "language": "url",
        "value": "https://github.com/BambuBlu/spacex-launch-tracker-app"
      }
    ]
  },
  {
    "id": "entry-2025-06-16-a",
    "title": "App Flow and Architecture: Structuring the SpaceX Launch Tracker — 1",
    "date": "2025-06-16",
    "tags": ["blog", "project"],
    "content": [
      {
        "type": "text",
        "value": "Now that the foundation of the SpaceX Launch Tracker App is in place, the next step was getting real data into the project. This post covers how the app fetches, in teory, launch data from the SpaceX API, and how I structured that data for quick access and clean rendering."
      },
      {
        "type": "text",
        "value": ""
      },
      {
        "type": "text",
        "value": "└ Connecting to the SpaceX API"
      },
      {
        "type": "image",
        "src": "../assets/img/spacexapp/basicDiagram.jpg",
        "alt": "Example Image"
      },
      {
        "type": "text",
        "value": "From the start, the app connects to the public SpaceX API, which provides detailed launch data. The two key endpoints used are:"
      },
      {
        "type": "code",
        "language": "code",
        "value": "/launches/past — for completed launches"
      },
      {
        "type": "code",
        "language": "code",
        "value": "/launches/upcoming — for planned future launches"
      },
      {
        "type": "text",
        "value": "When the app starts, both endpoints are queried immediately. The results are stored in two global variables (for now, using simple module-level JS variables), one for past launches and one for upcoming launches."
      },
      {
        "type": "text",
        "value": ""
      },
      {
        "type": "text",
        "value": "└ Data Structures and Optimization"
      },
      {
        "type": "image",
        "src": "../assets/img/spacexapp/basicDiagramCode.jpg",
        "alt": "Example Image"
      },
      {
        "type": "text",
        "value": "Rather than working with the full launch objects across the app — which are large and include a lot of unnecessary metadata — I created two additional structures:"
      },
      {
        "type": "code",
        "language": "code",
        "value": "A list of launch names (for things like search, random selection, etc.)"
      },
      {
        "type": "code",
        "language": "code",
        "value": "A dictionary mapping each launch name to its full object (for fast lookups)"
      },
      {
        "type": "text",
        "value": "This allows me to keep rendering and navigation fast and lightweight, without repeatedly traversing massive arrays or re-parsing nested objects."
      },
      {
        "type": "text",
        "value": ""
      },
      {
        "type": "text",
        "value": "└ Why This Structure?"
      },
      {
        "type": "text",
        "value": "Fetching and storing the data once — and then slicing it into helper structures — reduces overhead in the UI and navigation layers. Instead of repeatedly filtering or looping through large arrays, the app can look up exactly what it needs when it needs it."
      },
      {
        "type": "text",
        "value": "This approach also keeps the UI components clean and focused. They don't need to know about the shape of the full API — just the launch name or ID they're working with."
      }
    ]
  }
]
